#include <QMessageBox>
#include "mainwindow.h"
#include "aboutdialog.h"
#include "ui_mainwindow.h"

//---------------------------------------------------------------
//-- Конструкторы и деструкторы
//---------------------------------------------------------------

//-- Конструктор класса главного окна
//---------------------------------------------------------------
MainWindow::MainWindow(QWidget *parent) :
    QMainWindow(parent),
    ui(new Ui::MainWindow)
{
    ui->setupUi(this);          // Эта строчка сгенерирована автоматически
    checkers = new Checkers;    // Создаем объект логики приложения
    ui->centralWidget->setCheckers(checkers);   // И передаем его виджету
}

//-- Деструктор класса главного окна
//---------------------------------------------------------------
MainWindow::~MainWindow()
{
    delete ui;                  // Эта строчка сгенерирована автоматически
    delete checkers;            // Удалаяем объект логики приложения
}

//---------------------------------------------------------------
//-- Слоты обработки событий меню
//---------------------------------------------------------------

//-- Обработка выбора пункта "Новая игра"
//---------------------------------------------------------------
void MainWindow::on_newGame_triggered()
{
    checkers->init();               // Заново инициализируем логику
    ui->centralWidget->update();    // Виджет должен перерисоваться
}

//-- Обработка выбора пункта "Выход"
//---------------------------------------------------------------
void MainWindow::on_exit_triggered()
{
    close();                        // Закроем окно
}

//-- Обработка выбора пункта "О программе.."
//---------------------------------------------------------------
void MainWindow::on_about_triggered()
{
    AboutDialog * aboutBox = new AboutDialog(); // Создаем диалог
    aboutBox->exec();               // Запускаем его модально
    delete aboutBox;                // Удаляем диалог после закрытия
}
